In [31]:
import pandas as pd

In [32]:
india_weather = pd.DataFrame({
	'city':['mumbai','delhi','banglore'],
	'temperature':[32,45,30],
	'humidity':[80,60,78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [33]:
us_weather = pd.DataFrame({
	'city':['new york','chicago','orlando'],
	'temperature':[21,14,35],
	'humidity':[68,65,75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [23]:
df = pd.concat([india_weather,us_weather],ignore_index=True)
df # Concat data with seqeuntial number

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [34]:
df = pd.concat([india_weather,us_weather], keys=['India','us'])
df # Use key like a hashmap

             city  temperature  humidity
India 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
us    0  new york           21        68
      1   chicago           14        65
      2   orlando           35        75

In [36]:
df.loc['India'] # Locate value by use key

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [38]:
temperature_df = pd.DataFrame({
	'city': ['mumbai','delhi','banglore'],
	'temperature': [32,45,30]
})
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [40]:
windspeed_df = pd.DataFrame({
	'city': ['mumbai','delhi'],
	'windspeeds': [12,7]
},index=[0,1])
windspeed_df

     city  windspeeds
0  mumbai          12
1   delhi           7

In [42]:
pd.concat([temperature_df,windspeed_df],axis=1) # Concat with column by use axis=1

       city  temperature    city  windspeeds
0    mumbai           32  mumbai        12.0
1     delhi           45   delhi         7.0
2  banglore           30     NaN         NaN

In [43]:
df1 = pd.DataFrame({
	'city': ['new york','chicago','orlando'],
	'temperature': [21,14,35]
})
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [45]:
df2 = pd.DataFrame({
	'city': ['chicago','new york','orlando'],
	'humidity': [65,68,75]
})
df2

       city  humidity
0   chicago        65
1  new york        68
2   orlando        75

In [47]:
df3 = pd.merge(df1, df2, on='city')
df3 # Same with inner join

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [56]:
df1 = pd.DataFrame({
	'city': ['new york','chicago','orlando','baltimore'],
	'temperature': [21,14,35,38]
})
df1

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           38

In [58]:
df2 = pd.DataFrame({
	'city': ['chicago','new york','san diego'],
	'humidity': [65,68,71]
})
df2

        city  humidity
0    chicago        65
1   new york        68
2  san diego        71

In [60]:
df3 = pd.merge(df1, df2, on='city',how='inner')
df3 # Inner join

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

In [62]:
df3 = pd.merge(df1, df2, on='city', how='left')
df3 # Left join

        city  temperature  humidity
0   new york           21      68.0
1    chicago           14      65.0
2    orlando           35       NaN
3  baltimore           38       NaN

In [64]:
df3 = pd.merge(df1, df2, on='city', how='right')
df3 # Right join

        city  temperature  humidity
0    chicago         14.0        65
1   new york         21.0        68
2  san diego          NaN        71

In [65]:
df3 = pd.merge(df1, df2, on='city',how='outer')
df3 # Outer join

        city  temperature  humidity
0  baltimore         38.0       NaN
1    chicago         14.0      65.0
2   new york         21.0      68.0
3    orlando         35.0       NaN
4  san diego          NaN      71.0